public_html/Python/automation.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2020-06-03 Wed 15:39 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>AUTOMATION</title>
<meta name="generator" content="Org mode">
<meta name="author" content="John Doe">
<meta name="description" content="selenium webdriver python problems image processing threading configuration zettelkasten leetdatageek"
>
<link rel="stylesheet" type="text/css" href="/css/style.css" />
</head>
<body>
<div id="content">
<header>
<h1 class="title">AUTOMATION</h1>
</header><nav id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org32bb49b">1. Selenium &amp; WebDriver configuration</a></li>
</ul>
</div>
</nav>

<div id="outline-container-org32bb49b" class="outline-2">
<h2 id="org32bb49b"><span class="section-number-2">1</span> Selenium &amp; WebDriver configuration</h2>
<div class="outline-text-2" id="text-1">
<p>
If you want to work with automation - mainly in WSL or any other GNU/Linux system - you may not want to deal with a lot of windows popping up everywhere.
</p>

<p>
<a href="https://wiki.debian.org/Firefox">https://wiki.debian.org/Firefox</a>
<a href="https://github.com/mozilla/geckodriver/releases">https://github.com/mozilla/geckodriver/releases</a> (Supports Firefox version &gt;= 60)
</p>
<p>
<a href="https://emacs.stackexchange.com/questions/30595/how-to-org-capture-at-current-location">insert at current location</a>
</p>
<div class="org-src-container">
<pre class="src src-shell">  <span style="color: #ECBE7B;">sudo</span> apt-get install firefox-esr
  wget https://github.com/mozilla/geckodriver/releases/download/v0.26.0/geckodriver-v0.26.0-linux64.tar.gz
  tar -xvf geckodriver-v0.26.0-linux64.tar.gz
  <span style="color: #ECBE7B;">chmod</span> +x geckodriver
</pre>
</div>

<p>
Copy the file to /bin or put the script in /usr/bin or in your custom folder and add it to the PATH environment variable.
</p>

<div class="org-src-container">
<pre class="src src-python">  <span style="color: #51afef;">from</span> selenium <span style="color: #51afef;">import</span> webdriver
  <span style="color: #51afef;">from</span> selenium.webdriver.firefox.options <span style="color: #51afef;">import</span> Options
  <span style="color: #51afef;">import</span> os
  <span style="color: #51afef;">import</span> time
  
  <span style="color: #dcaeea;">options</span> = Options()
  <span style="color: #dcaeea;">options.headless</span> = <span style="color: #a9a1e1;">True</span> <span style="color: #5B6268;"># </span><span style="color: #5B6268;">Important for CLI work</span>
  <span style="color: #dcaeea;">driver</span> = webdriver.Firefox(options=options)
  driver.get(<span style="color: #98be65;">"http://www.google.com"</span>)
  time.sleep(<span style="color: #da8548; font-weight: bold;">1</span>)
  <span style="color: #51afef;">assert</span> <span style="color: #98be65;">"google - Google Search"</span> <span style="color: #51afef;">in</span> driver.title
  <span style="color: #51afef;">print</span>(driver.title)
  driver.<span style="color: #a9a1e1;">quit</span>()
</pre>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: John Doe</p>
<p class="date">Created: 2020-06-03 Wed 15:39</p>
</div>
</body>
</html>
